Repository: Alexgo25/Kids-n-Code
Catalog: Codebusters_sample/*.lproj/Localizable.strings
Languages: ru

# GOOD_ALGORITHM
source: Excellent! Your code is perfect!
ru: Молодец! Ты нашел оптимальный алгоритм!

# AVG_ALGORITHM1
source: Good! Optimize the algorithm to make it more efficient
ru: Отлично! Осталось изменить всего несколько

# BAD_ALGORITHM1
source: You've done it! Now, let’s change
ru: Хорошо! Теперь давай попробуем составить

# BAD_ALGORITHM2
source: the program to make it shorter
ru: программу с меньшим количеством действий

# Tutorial_0
source: Tutorial_0_en
ru: Tutorial_0_ru

# Tutorial_1
source: Tutorial_1_en
ru: Tutorial_1_ru

# Tutorial_2
source: Tutorial_2_en
ru: Tutorial_2_ru

# Tutorial_3
source: Tutorial_3_en
ru: Tutorial_3_ru

# Tutorial_4
source: Tutorial_4_en
ru: Tutorial_4_ru

# Tutorial_5
source: Tutorial_5_en
ru: Tutorial_5_ru

# Tutorial_6
source: Tutorial_6_en
ru: Tutorial_6_ru

# Tutorial_7
source: Tutorial_7_en
ru: Tutorial_7_ru

# Tutorial_8
source: Tutorial_8_en
ru: Tutorial_8_ru

# Tutorial_9
source: Tutorial_9_en
ru: Tutorial_9_ru

# Tutorial_10
source: Tutorial_10_en
ru: Tutorial_10_ru

# Tutorial_11
source: Tutorial_11_en
ru: Tutorial_11_ru

# Tutorial_12
source: Tutorial_12_en
ru: Tutorial_12_ru

# Tutorial_13
source: Tutorial_13_en
ru: Tutorial_13_ru

# Tutorial_14
source: Tutorial_14_en
ru: Tutorial_14_ru

# Tutorial_15
source: Tutorial_15_en
ru: Tutorial_15_ru

# Tutorial_16
source: Tutorial_16_en
ru: Tutorial_16_ru

# Tutorial_17
source: Tutorial_17_en
ru: Tutorial_17_ru

# Tutorial_18
source: Tutorial_18_en
ru: Tutorial_18_ru

# DetailTextSuffix
source: _Text_en
ru: _Text_ru

# First_Text
source: First_Text_en
ru: First_Text_ru

# finalView
source: finalView_en
ru: finalView_ru

# RESUME_BUTTON
source: RESUME
ru: ПРОДОЛЖИТЬ

# QUIT_BUTTON
source: QUIT
ru: ВЫЙТИ

# RESTART_BUTTON
source: RESTART
ru: ЗАНОВО

# ACHIEVEMENTS_BUTTON
source: ACHIEVEMENTS
ru: ДОСТИЖЕНИЯ

# SOUNDS_SWITCHER
source: Sound
ru: Звуки

# MUSIC_SWITCHER
source: Music
ru: Музыка

# SWITCHER_MODE_ON
source: ON
ru: ВКЛ

# SWITCHER_MODE_OFF
source: OFF
ru: ВЫКЛ

# PROGRAM_LABEL
source: Program
ru: Программа

# ONSTART_LABEL
source: ON START
ru: ПОСЛЕ ЗАПУСКА

# RESTART_BUTTON_LABEL
source: Restart
ru: Заново

# DEBUG_BUTTON_LABEL
source: Debug
ru: Отладка

# RETURN_BUTTON_LABEL
source: Return
ru: В начало

# START_BUTTON_LABEL
source: Run
ru: Запуск

# CANCEL_LC_BUTTON_LABEL
source: Cancel
ru: Отмена

# OK_LC_BUTTON_LABEL
source: Ok
ru: Готово

# REPEAT_LC_LABEL
source: Repeat x
ru: Повторить x

# NUMBER_OF_REPEATS_LABEL
source: Number of repeats:
ru: Число повторений:

# STEP_BUTTON_LABEL
source: STEP
ru: ШАГНУТЬ

# TURN_BUTTON_LABEL
source: TURN
ru: ПОВЕРНУТЬСЯ

# PUSH_BUTTON_LABEL
source: PUSH
ru: ТОЛКНУТЬ

# JUMP_BUTTON_LABEL
source: JUMP
ru: ПРЫГНУТЬ

# CATCH_BUTTON_LABEL
source: CATCH
ru: ПОЙМАТЬ

# CONTINUE_PLAYING_LABEL
source: Next level
ru: Играть дальше

# QUIT_TO_MENU_LABEL
source: Quit to menu
ru: Выйти в меню
